"use strict";
// ================ змінні
// 0. Вводиться ім’я користувача («Гість» якщо не введе). Привітати користувача
// Ввести ім’я користувача («Гість» якщо не введе) і його вік (0 якщо не введе). Якщо вік більше 17 привітати,  інакше – повідомити про заборону відвідування сайту
// 2. Створити змінні для збереження інформації про книгу: title (рядок), pages (число), isPublished (булеве).
// 3. Додайте типи даних
// let userName = "Andrii";
// let age = 47;
// let isAdmin = false;
// let empty = null;
// let notAssigned = undefined;
// let id = Symbol("uniqueId");
// let bigNumber = 9007199254740993n;
// 3. Обчисти периметр трикутника
//--------------------
// let userName = "Andrii";
// let age = 47;
// let isAdmin = false;
// let empty = null;
// let notAssigned = undefined
// let id = Symbol('uniqueId')
// let bigNumber = 9007199254740993n;
// 4. Вводиться номер місця, яку зайняв спорсмен. Визначити нагороду (використаи оператор вибору)
// ============= Type Inference
// Які типи даних будуть визначені?
// let city = "Kyiv”
// let temperature = 18
// let email = "test@gmail.com"
// let temperature = “number”
// let temp = “Date”
//============ unknown
// 1. Величина випадковим чином може отримувати значенян рядка, або числа, або об’єкта .
// Реалізуйте перевірку:
// якщо прийшов рядок → вивести "Рядок довжиною: X",
// якщо число → "Квадрат числа: X",
// якщо об’єкт і в ньому є поле name → вивести "Привіт, [name]",
// в іншому випадку → "Невідомий тип даних".
// 2. Створіть масив values.Додайте у нього рядки, числа й об’єкти.Виведіть довжину масиву.
// 3. Створіть блок try..catch, у якому виконується throw "Помилка" або throw 404.У catch опишіть параметр.Виведіть у консоль:якщо рядок → "Помилка: [текст]",якщо число → "Код помилки: [число]".
//====================== union
// 1. Користувач вводить ім’я. Якщо відмовиться, то заборонити доступ
// 2. Випадковим чином генерується число або якийсь рядок. Пірахувати чого було більше чисел чи рядків і вивести
// останне число і останній рядок
//================ Literals
// 1. Потрібно ввести стать студента ("male", "female"). У залежносі від цього додати Mr, Ms.
// 2. Вводиться статус відповіді. Потрібно визначити рядкове представлення ("success" ,  "error")
// 3. Вводиться сума грошей і позначення валюти. Потрібно перевести кількість гривень у кількість обраної валюти ("USD" ,  "EUR" , "UAH")
//===================== Union+Literals
//Випадковим чином генерується число або рядок «Ок». Пірахувати чого було більше чисел чи рядків і вивести останні значення
//================== void
// Створити функцію, яка виводить у консоль потончну дату
//============ never
// З клавіатури вводиться пора року. Вивести рекомндований одяг.
//============ overloading
// Передається або номер дня, або назву дня на англійькій. Треба сказати чи вихідний чи робочий.
//============= array
// Планувальник відпусток. Дано масив імен водіїв і масив номерів, коли можна йти у відпустку. Потрібно випадково вибрати ім’я водія і випадково вибрати номер місяця для відпустки.
//============= array (union)
// Сформувати масив значень ігрового барабана. Це або виграшна сума, або «Пауза», «Банкрот», «Супер приз»
//============= array
// Сформувати двовимірний масив (5*5) ігрового поля. Усі елементи нулі, або 1-корабель (4 штуки), або ‘block’- земля (5 штук)
// =========== Tuple
// Дано набір налаштувань (ключ-значення(enabled/disabled)). Вивести ті, які є увімкненими
// Дано масив маркерів на картів [lat, long, city]. Визначити найближче місто до вказаних координат
// ========== Enum
// Створіть enum TrafficLight зі значеннями "Red", "Yellow", "Green"
// Потрібно ввести стать студента ("male", "female"). У залежносі від цього додати Mr, Ms.
// Вводиться статус відповіді. Потрібно визначити рядкове представлення ("success" ,  "error")
// Вводиться сума грошей і позначення валюти. Потрібно перевести кількість гривень у кількість обраної валюти ("USD" ,  "EUR" , "UAH")
